In [5]:
library(sqldf)

In [3]:
head(mtcars)

                  mpg  cyl disp hp  drat wt    qsec  vs am gear carb
Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
Datsun 710        22.8 4   108   93 3.85 2.320 18.61 1  1  4    1
Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44 1  0  3    1
Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2
Valiant           18.1 6   225  105 2.76 3.460 20.22 1  0  3    1

In [7]:
sqldf("SELECT * from mtcars limit 5")

  mpg  cyl disp hp  drat wt    qsec  vs am gear carb
1 21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
2 21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
3 22.8 4   108   93 3.85 2.320 18.61 1  1  4    1
4 21.4 6   258  110 3.08 3.215 19.44 1  0  3    1
5 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2

In [15]:
mtcars[mtcars$mpg>20 & mtcars$am==1,]
sqldf("SELECT * from mtcars where mpg>20 and am==1")

               mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
Mazda RX4      21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag  21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4
Datsun 710     22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1
Fiat 128       32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1
Honda Civic    30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2
Toyota Corolla 33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1
Fiat X1-9      27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1
Porsche 914-2  26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2
Lotus Europa   30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2
Volvo 142E     21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2

   mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
1  21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4
2  21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4
3  22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1
4  32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1
5  30.4 4    75.7  52 4.93 1.615 18.52 1  1  4    2
6  33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1
7  27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1
8  26.0 4   120.3  91 4.43 2.140 16.70 0  1  5    2
9  30.4 4    95.1 113 3.77 1.513 16.90 1  1  5    2
10 21.4 4   121.0 109 4.11 2.780 18.60 1  1  4    2

In [27]:
mean(mtcars[mtcars$cyl==6,]$mpg)
sqldf("SELECT avg(mpg) from mtcars where cyl==6")

[1] 19.74286

  avg(mpg)
1 19.74286

In [48]:
table_A = data.frame(
    PK = c(1, 2, 3, 6, 7, 5, 4, 10),
    Value = c("FOX", "COP", "TAXI", "WASHINGTON", "DELL", "ARIZONA", "APPLE", "GOOGLE")
)

table_B = data.frame(
    PK = c(1, 2, 3, 6, 7, 8, 9, 11),
    Value = c("TROT", "CAR", "CAB", "MONUMENT", "PC", "MICROSOFT", "AMAZON", "TESLA")
)

table_A
table_B

  PK Value
1  1 FOX
2  2 COP
3  3 TAXI
4  6 WASHINGTON
5  7 DELL
6  5 ARIZONA
7  4 APPLE
8 10 GOOGLE

  PK Value
1  1 TROT
2  2 CAR
3  3 CAB
4  6 MONUMENT
5  7 PC
6  8 MICROSOFT
7  9 AMAZON
8 11 TESLA

## INNER JOIN

In [56]:
sqldf("SELECT * FROM table_A, table_B where table_A.PK == table_B.PK")

  PK Value      PK Value
1 1  FOX        1  TROT
2 2  COP        2  CAR
3 3  TAXI       3  CAB
4 6  WASHINGTON 6  MONUMENT
5 7  DELL       7  PC

In [ ]:
sqldf("SELECT * FROM table_A A INNER JOIN table_B B ON A.PK = B.PK")

  PK Value      PK Value
1 1  FOX        1  TROT
2 2  COP        2  CAR
3 3  TAXI       3  CAB
4 6  WASHINGTON 6  MONUMENT
5 7  DELL       7  PC

## NATURAL JOIN

In [73]:
sqldf("SELECT * FROM table_A A NATURAL JOIN table_B B ")

     PK Value

## LEFT OUTER JOIN

Left == Left Outer

In [ ]:
sqldf("SELECT * FROM table_A A LEFT OUTER JOIN table_B B ON A.PK = B.PK")

  PK Value      PK Value
1  1 FOX         1 TROT
2  2 COP         2 CAR
3  3 TAXI        3 CAB
4  6 WASHINGTON  6 MONUMENT
5  7 DELL        7 PC
6  5 ARIZONA    NA NA
7  4 APPLE      NA NA
8 10 GOOGLE     NA NA

## RIGHT OUTER JOIN

In [64]:
sqldf("SELECT * FROM table_A A RIGHT OUTER JOIN table_B B ON A.PK = B.PK")

  PK Value      PK Value
1  1 FOX         1 TROT
2  2 COP         2 CAR
3  3 TAXI        3 CAB
4  6 WASHINGTON  6 MONUMENT
5  7 DELL        7 PC
6 NA NA          8 MICROSOFT
7 NA NA          9 AMAZON
8 NA NA         11 TESLA

## FULL OUTER JOIN

In [75]:
sqldf("SELECT * FROM table_A A FULL OUTER JOIN table_B B ON A.PK = B.PK")

   PK Value      PK Value
1   1 FOX         1 TROT
2   2 COP         2 CAR
3   3 TAXI        3 CAB
4   6 WASHINGTON  6 MONUMENT
5   7 DELL        7 PC
6   5 ARIZONA    NA NA
7   4 APPLE      NA NA
8  10 GOOGLE     NA NA
9  NA NA          8 MICROSOFT
10 NA NA          9 AMAZON
11 NA NA         11 TESLA

In [81]:
sqldf("SELECT * FROM table_A A LEFT JOIN table_B B ON A.PK = B.PK
UNION
SELECT * FROM table_A A RIGHT JOIN table_B B ON A.PK = B.PK
")

   PK Value      PK Value
1  NA NA          8 MICROSOFT
2  NA NA          9 AMAZON
3  NA NA         11 TESLA
4   1 FOX         1 TROT
5   2 COP         2 CAR
6   3 TAXI        3 CAB
7   4 APPLE      NA NA
8   5 ARIZONA    NA NA
9   6 WASHINGTON  6 MONUMENT
10  7 DELL        7 PC
11 10 GOOGLE     NA NA

## Left/Right Join Excluding Inner Join

In [92]:
sqldf("
SELECT * FROM table_A A LEFT OUTER JOIN table_B B ON A.PK = B.PK
where B.PK IS NULL
")

sqldf("
SELECT * FROM table_A A RIGHT OUTER JOIN table_B B ON A.PK = B.PK
where A.PK IS NULL
")

  PK Value   PK Value
1  5 ARIZONA NA NA
2  4 APPLE   NA NA
3 10 GOOGLE  NA NA

  PK Value PK Value
1 NA NA     8 MICROSOFT
2 NA NA     9 AMAZON
3 NA NA    11 TESLA

In [101]:
sqldf("
SELECT * FROM table_A A FULL OUTER JOIN table_B B ON A.PK = B.PK
WHERE A.PK IS NULL or B.PK IS NULL
")

  PK Value   PK Value
1  5 ARIZONA NA NA
2  4 APPLE   NA NA
3 10 GOOGLE  NA NA
4 NA NA       8 MICROSOFT
5 NA NA       9 AMAZON
6 NA NA      11 TESLA

## CROSS JOIN
Cartesian Product Join, joins every record in A&B

In [106]:
sqldf("SELECT * FROM table_A A CROSS JOIN table_B B")

   PK Value      PK Value
1  1  FOX         1 TROT
2  1  FOX         2 CAR
3  1  FOX         3 CAB
4  1  FOX         6 MONUMENT
5  1  FOX         7 PC
6  1  FOX         8 MICROSOFT
7  1  FOX         9 AMAZON
8  1  FOX        11 TESLA
9  2  COP         1 TROT
10 2  COP         2 CAR
11 2  COP         3 CAB
12 2  COP         6 MONUMENT
13 2  COP         7 PC
14 2  COP         8 MICROSOFT
15 2  COP         9 AMAZON
16 2  COP        11 TESLA
17 3  TAXI        1 TROT
18 3  TAXI        2 CAR
19 3  TAXI        3 CAB
20 3  TAXI        6 MONUMENT
21 3  TAXI        7 PC
22 3  TAXI        8 MICROSOFT
23 3  TAXI        9 AMAZON
24 3  TAXI       11 TESLA
25 6  WASHINGTON  1 TROT
26 6  WASHINGTON  2 CAR
27 6  WASHINGTON  3 CAB
28 6  WASHINGTON  6 MONUMENT
29 6  WASHINGTON  7 PC
30 6  WASHINGTON  8 MICROSOFT
⋮  ⋮  ⋮          ⋮  ⋮
35  7 DELL        3 CAB
36  7 DELL        6 MONUMENT
37  7 DELL        7 PC
38  7 DELL        8 MICROSOFT
39  7 DELL        9 AMAZON
40  7 DELL       11 TESLA
41  5 ARIZONA     1 TROT
42  5 ARIZONA     2 CAR
43  5 ARIZONA     3 CAB
44  5 ARIZONA     6 MONUMENT
45  5 ARIZONA     7 PC
46  5 ARIZONA     8 MICROSOFT
47  5 ARIZONA     9 AMAZON
48  5 ARIZONA    11 TESLA
49  4 APPLE       1 TROT
50  4 APPLE       2 CAR
51  4 APPLE       3 CAB
52  4 APPLE       6 MONUMENT
53  4 APPLE       7 PC
54  4 APPLE       8 MICROSOFT
55  4 APPLE       9 AMAZON
56  4 APPLE      11 TESLA
57 10 GOOGLE      1 TROT
58 10 GOOGLE      2 CAR
59 10 GOOGLE      3 CAB
60 10 GOOGLE      6 MONUMENT
61 10 GOOGLE      7 PC
62 10 GOOGLE      8 MICROSOFT
63 10 GOOGLE      9 AMAZON
64 10 GOOGLE     11 TESLA

In [113]:
library(dplyr)

inner_join(table_A, table_B, by = "PK")
left_join(table_A, table_B, by = "PK")
right_join(table_A, table_B, by = "PK")
full_join(table_A, table_B, by = "PK")

# merge(table_A, table_B, by = "PK")

  PK Value.x    Value.y
1 1  FOX        TROT
2 2  COP        CAR
3 3  TAXI       CAB
4 6  WASHINGTON MONUMENT
5 7  DELL       PC

  PK Value.x    Value.y
1  1 FOX        TROT
2  2 COP        CAR
3  3 TAXI       CAB
4  6 WASHINGTON MONUMENT
5  7 DELL       PC
6  5 ARIZONA    NA
7  4 APPLE      NA
8 10 GOOGLE     NA

  PK Value.x    Value.y
1  1 FOX        TROT
2  2 COP        CAR
3  3 TAXI       CAB
4  6 WASHINGTON MONUMENT
5  7 DELL       PC
6  8 NA         MICROSOFT
7  9 NA         AMAZON
8 11 NA         TESLA

   PK Value.x    Value.y
1   1 FOX        TROT
2   2 COP        CAR
3   3 TAXI       CAB
4   6 WASHINGTON MONUMENT
5   7 DELL       PC
6   5 ARIZONA    NA
7   4 APPLE      NA
8  10 GOOGLE     NA
9   8 NA         MICROSOFT
10  9 NA         AMAZON
11 11 NA         TESLA

In [129]:
# install.packages("RH2")
# install.packages("rJava")
# install.packages("RJDBC")
# library(RH2)

In [125]:
data(UCBAdmissions)

ucb = as.data.frame(UCBAdmissions)
class(ucb)
sqldf("SeLECT * FROM ucb LIMIT 5")

[1] "data.frame"

  Admit    Gender Dept Freq
1 Admitted Male   A    512
2 Rejected Male   A    313
3 Admitted Female A     89
4 Rejected Female A     19
5 Admitted Male   B    353

In [131]:
majors <- data.frame(
    major =c("math", "biology", "engineering", "computer science", "history", "architecture"),
    Dept = c(LETTERS[1:5], "Other"), Faculty = round(runif(6, min =10, max = 30)))

majors

  major            Dept  Faculty
1 math             A     14
2 biology          B     23
3 engineering      C     25
4 computer science D     17
5 history          E     26
6 architecture     Other 12

In [206]:
# sqldf("SELECT * FROM ucb where Gender='Female'")
# sqldf("SELECT * FROM ucb where Admit='Admitted'")
# sqldf("SELECT Sum(Freq) FROM ucb where Admit='Admitted'")
# sqldf("select COUNT(DISTINCT(major)) from majors")

# sqldf("SELECT Dept, SUM(FREQ) FROM ucb GROUP BY Dept")
sqldf("SELECT Dept, SUM(Freq) FROM ucb WHERE Admit='Admitted' AND Freq BETWEEN 20 AND 100 group by Dept")

sqldf("SELECT * from ucb JOIN majors ON ucb.Dept=majors.Dept")
sqldf("SELECT * from ucb LEFT JOIN majors ON ucb.Dept=majors.Dept")
sqldf("SELECT * from ucb RIGHT JOIN majors ON ucb.Dept=majors.Dept")

  Dept SUM(Freq)
1 A     89
2 E    147
3 F     46

   Admit    Gender Dept Freq major            Dept Faculty
1  Admitted Male   A    512  math             A    14
2  Rejected Male   A    313  math             A    14
3  Admitted Female A     89  math             A    14
4  Rejected Female A     19  math             A    14
5  Admitted Male   B    353  biology          B    23
6  Rejected Male   B    207  biology          B    23
7  Admitted Female B     17  biology          B    23
8  Rejected Female B      8  biology          B    23
9  Admitted Male   C    120  engineering      C    25
10 Rejected Male   C    205  engineering      C    25
11 Admitted Female C    202  engineering      C    25
12 Rejected Female C    391  engineering      C    25
13 Admitted Male   D    138  computer science D    17
14 Rejected Male   D    279  computer science D    17
15 Admitted Female D    131  computer science D    17
16 Rejected Female D    244  computer science D    17
17 Admitted Male   E     53  history          E    26
18 Rejected Male   E    138  history          E    26
19 Admitted Female E     94  history          E    26
20 Rejected Female E    299  history          E    26

   Admit    Gender Dept Freq major            Dept Faculty
1  Admitted Male   A    512  math             A    14
2  Rejected Male   A    313  math             A    14
3  Admitted Female A     89  math             A    14
4  Rejected Female A     19  math             A    14
5  Admitted Male   B    353  biology          B    23
6  Rejected Male   B    207  biology          B    23
7  Admitted Female B     17  biology          B    23
8  Rejected Female B      8  biology          B    23
9  Admitted Male   C    120  engineering      C    25
10 Rejected Male   C    205  engineering      C    25
11 Admitted Female C    202  engineering      C    25
12 Rejected Female C    391  engineering      C    25
13 Admitted Male   D    138  computer science D    17
14 Rejected Male   D    279  computer science D    17
15 Admitted Female D    131  computer science D    17
16 Rejected Female D    244  computer science D    17
17 Admitted Male   E     53  history          E    26
18 Rejected Male   E    138  history          E    26
19 Admitted Female E     94  history          E    26
20 Rejected Female E    299  history          E    26
21 Admitted Male   F     22  NA               NA   NA
22 Rejected Male   F    351  NA               NA   NA
23 Admitted Female F     24  NA               NA   NA
24 Rejected Female F    317  NA               NA   NA

   Admit    Gender Dept Freq major            Dept  Faculty
1  Admitted Male   A    512  math             A     14
2  Rejected Male   A    313  math             A     14
3  Admitted Female A     89  math             A     14
4  Rejected Female A     19  math             A     14
5  Admitted Male   B    353  biology          B     23
6  Rejected Male   B    207  biology          B     23
7  Admitted Female B     17  biology          B     23
8  Rejected Female B      8  biology          B     23
9  Admitted Male   C    120  engineering      C     25
10 Rejected Male   C    205  engineering      C     25
11 Admitted Female C    202  engineering      C     25
12 Rejected Female C    391  engineering      C     25
13 Admitted Male   D    138  computer science D     17
14 Rejected Male   D    279  computer science D     17
15 Admitted Female D    131  computer science D     17
16 Rejected Female D    244  computer science D     17
17 Admitted Male   E     53  history          E     26
18 Rejected Male   E    138  history          E     26
19 Admitted Female E     94  history          E     26
20 Rejected Female E    299  history          E     26
21 NA       NA     NA    NA  architecture     Other 12

In [218]:
# library(ggplot2)
data(diamonds)

nrow(diamonds)
sqldf("SELECT COUNT(*) from diamonds")

[1] 53940

  COUNT(*)
1 53940

In [228]:
diamond = sqldf("SELECT * from diamonds")
# head(diamond)
# sqldf("SELECT * FROM diamond WHERE cut='Ideal'")

# sqldf("SELECT * FROM diamond")

In [233]:
sqldf("SELECT * FROM diamond limit 5")

  carat cut     color clarity depth table price x    y    z
1 0.23  Ideal   E     SI2     61.5  55    326   3.95 3.98 2.43
2 0.21  Premium E     SI1     59.8  61    326   3.89 3.84 2.31
3 0.23  Good    E     VS1     56.9  65    327   4.05 4.07 2.31
4 0.29  Premium I     VS2     62.4  58    334   4.20 4.23 2.63
5 0.31  Good    J     SI2     63.3  58    335   4.34 4.35 2.75

In [249]:
diamond_details <- data.frame(carat=c(0.23, 0.31, 0.7, 1.01, 1.5),
detail = c("small size", "small size", "medium size", "large size", "very large size"))
diamond_details

sqldf("SELECT D.carat, D.price, DD.detail FROM diamond D JOIN diamond_details DD ON D.carat=DD.carat limit 5")

  carat detail
1 0.23  small size
2 0.31  small size
3 0.70  medium size
4 1.01  large size
5 1.50  very large size

  carat price detail
1 0.23  326   small size
2 0.23  327   small size
3 0.31  335   small size
4 0.23  338   small size
5 0.23  340   small size